app/Controllers/CustomersController.php

    public function index()
    {
        // AMBIL DATA
        $model = new CustomerModel();

        // Join ke tabel inets
        $builder = $model->db->table('customers');
        $builder->select('customers.*, inets.inet_name as inet');
        $builder->join('inets', 'inets.inet_id = customers.inet', 'left');
        $data['customers'] = $builder->get()->getResultArray();
---
SELECT `customers`.*, `inets`.`inet_name` as `inet`
FROM `customers`
LEFT JOIN `inets` ON `inets`.`inet_id` = `customers`.`inet`

    public function create()
    {
        $model = new InetModel();
        $data['inets'] = $model->findAll();
---
SELECT *
FROM `inets`

    public function edit($customer_id)
    {
        $model = new CustomerModel();
        // $data['customer'] = $model->find('customer_id',$customer_id);
        $data['customer'] = $model->where('customer_id', $customer_id)->first();

        $inetModel = new InetModel();
        $data['inets'] = $inetModel->findAll();
---
SELECT *
FROM `customers`
WHERE `customer_id` = '1'
 LIMIT 1
SELECT *
FROM `inets`

    public function delete($customer_id)
    {
        $model = new CustomerModel();
        $model->where('customer_id', $customer_id)->delete();
---
DELETE FROM `customers`
WHERE `customer_id` = '4'