app/Controllers/InetsController.php

SELECT *
FROM `inets`
---
    public function index()
    {
        $model = new InetModel();
        $data['inets'] = $model->findAll();

INSERT INTO `inets` (`inet_name`, `inet_price`) VALUES ('Sultan', '400000')
---
    public function store()
    {
        $model = new InetModel();

        $data = [
            'inet_name' => $this->request->getPost('inet_name'),
            'inet_price' => $this->request->getPost('inet_price')
        ];

        $model->insert($data);

SELECT *
FROM `inets`
WHERE `inet_id` = '3'
 LIMIT 1
---
    public function edit($inet_id)
    {
        $model = new InetModel();
        $data['inet'] = $model->where('inet_id', $inet_id)->first();

UPDATE `inets` SET `inet_name` = '300MB', `inet_price` = '300000'
WHERE `inet_id` = '3'
---
    public function update($inet_id)
    {
        $model = new InetModel();

        $data = [
            'inet_name' => $this->request->getPost('inet_name'),
            'inet_price' => $this->request->getPost('inet_price')
        ];

        $model->where('inet_id', $inet_id)->set($data)->update();

DELETE FROM `inets`
WHERE `inet_id` = '4'
---
    public function delete($inet_id)
    {
        $model = new InetModel();

        $model->where('inet_id', $inet_id)->delete();